Repository: frankfu0714-cyber/wordstory-ios
Catalog: wordstory/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hant

# action.cancel
source: Cancel
zh_hant: 取消

# action.delete
source: Delete
zh_hant: 刪除

# action.done
source: Done
zh_hant: 完成

# action.mark_learned
source: Mark as learned
zh_hant: 標記已學會

# action.mark_unlearned
source: Mark unlearned
zh_hant: 標記未學會

# add_field.duplicate_toast
source: Already in your list
zh_hant: 已在清單中

# add_field.placeholder
source: Add a new word...
zh_hant: 新增詞語…

# definition.add_your_own
source: Add your own meaning
zh_hant: 自己填寫釋義

# definition.edit.dictionary_label
source: Dictionary entry
zh_hant: 詞典釋義

# definition.edit.placeholder
source: Type your own Chinese meaning…
zh_hant: 輸入你自己的中文釋義…

# definition.edit.reset
source: Reset to dictionary
zh_hant: 還原為詞典釋義

# definition.edit.save
source: Save
zh_hant: 儲存

# definition.edit.title
source: Edit meaning
zh_hant: 編輯釋義

# detail.no_definition
source: (no definition yet)
zh_hant: （尚無釋義）

# error.decoding
source: Could not read the server's response.
zh_hant: 無法解析伺服器的回應。

# error.generic
source: Generation failed. Please try again.
zh_hant: 生成失敗，請再試一次。

# error.invalid_response
source: The server returned an invalid response.
zh_hant: 伺服器回應異常。

# error.server_generic
source: Something went wrong on the server.
zh_hant: 伺服器發生錯誤。

# nav.settings
source: Settings
zh_hant: 設定

# regenerate.title
source: Regenerate
zh_hant: 重新生成

# saved.empty_state
source: No saved stories yet. Generated stories appear here automatically.
zh_hant: 尚未有故事。產生的故事會自動出現在這裡。

# saved.failed
source: Generation failed
zh_hant: 產生失敗

# saved.generating
source: Generating…
zh_hant: 正在產生…

# saved.regenerate
source: Regenerate with same words
zh_hant: 用相同單字重新生成

# saved.regenerate.no_vocab
source: Vocab no longer in your list
zh_hant: 原本的單字已不在清單中

# saved.regenerate.toast
source: Generating a new variation…
zh_hant: 正在生成新的版本…

# saved.retry
source: Retry
zh_hant: 重試

# saved.save_button
source: Save
zh_hant: 儲存

# saved.saved_toast
source: Saved to your library
zh_hant: 已加入收藏

# saved.swipe.edit
source: Edit
zh_hant: 編輯

# saved.tab
source: Saved
zh_hant: 已儲存

# saved.title.done
source: Done
zh_hant: 完成

# saved.title.edit
source: Edit title
zh_hant: 編輯標題

# saved.title.placeholder
source: Story title
zh_hant: 故事標題

# saved.unsaved_toast
source: Removed from saves
zh_hant: 已從收藏移除

# saved.vocabulary.label
source: Vocabulary
zh_hant: 詞彙

# saved.vocabulary.tap_hint
source: Opens the word's definition
zh_hant: 開啟此詞的釋義

# search.placeholder
source: Search…
zh_hant: 搜尋…

# settings.about.feedback
source: Feedback / about
zh_hant: 回饋意見 / 關於

# settings.about.label
source: About
zh_hant: 關於

# settings.about.version
source: Version
zh_hant: 版本

# settings.clear.button
source: Clear all words
zh_hant: 清除所有詞彙

# settings.clear.confirm.confirm
source: Clear
zh_hant: 清除

# settings.clear.confirm.message
source: Every saved word, definition, and example will be removed from this device.
zh_hant: 本機所有已存詞彙、釋義與例句皆會刪除。

# settings.clear.confirm.title
source: Clear all words?
zh_hant: 清除所有詞彙？

# settings.clear.hint
source: This cannot be undone.
zh_hant: 此動作無法復原。

# settings.direction.hint
source: Tap to swap. Existing words keep their original direction.
zh_hant: 點此切換。已存在的詞會保留原本的方向。

# settings.direction.label
source: Direction
zh_hant: 學習方向

# settings.direction.learning
source: I'm learning
zh_hant: 我正在學

# settings.language.hint
source: Changes apply fully on next launch.
zh_hant: 下次啟動時完整套用。

# settings.language.label
source: Language
zh_hant: 介面語言

# settings.language.system
source: Follow system
zh_hant: 跟隨系統

# settings.title
source: Settings
zh_hant: 設定

# sort.alpha
source: A–Z
zh_hant: 字母序

# sort.recent
source: Recently added
zh_hant: 最近加入

# sort.title
source: Sort
zh_hant: 排序

# sort.unlearned
source: Unlearned first
zh_hant: 未學會的優先

# speech.button.aria
source: Pronounce word
zh_hant: 播放發音

# story.aria.chinese_for %@
source: Chinese for: %@
zh_hant: 中文：%@

# story.custom.placeholder
source: Describe your own style…
zh_hant: 描述你想要的風格…

# story.generate
source: Generate
zh_hant: 生成

# story.generating
source: Writing…
zh_hant: 撰寫中…

# story.hide_chinese
source: Hide Chinese
zh_hant: 隱藏中文

# story.meta.count %lld
source: %lld words woven in
zh_hant: 已織入 %lld 個詞彙

# story.regenerate
source: Regenerate
zh_hant: 重新生成

# story.select.all_unlearned
source: Select all unlearned
zh_hant: 全選未學會

# story.select.clear
source: Clear
zh_hant: 清除

# story.select.count %lld
source: %lld selected
zh_hant: 已選 %lld 個

# story.select.empty
source: Add some words first.
zh_hant: 請先加入一些詞彙。

# story.select.label
source: Select words to include
zh_hant: 選擇要用到的詞

# story.show_chinese
source: Show Chinese
zh_hant: 顯示中文

# story.style.label
source: Style
zh_hant: 體裁

# story.toast.generating
source: Generating story — you'll find it in the Saved tab
zh_hant: 正在產生故事 — 可在「已儲存」分頁查看

# style.custom.description
source: Describe your own style
zh_hant: 自行描述風格

# style.custom.title
source: Custom
zh_hant: 自訂

# style.dialogue.description
source: Two characters speaking
zh_hant: 兩人之間的對話

# style.dialogue.title
source: Dialogue
zh_hant: 對話

# style.letter.description
source: A warm personal letter
zh_hant: 一封親切的個人書信

# style.letter.title
source: Letter
zh_hant: 書信

# style.news_article.description
source: ~200 words, journalistic
zh_hant: 約 200 字，新聞體

# style.news_article.title
source: News article
zh_hant: 新聞報導

# style.poem.description
source: Short, vivid, looser usage
zh_hant: 短小生動，用法寬鬆

# style.poem.title
source: Poem
zh_hant: 詩

# style.short_story.description
source: ~150 words, one scene
zh_hant: 約 150 字，一個場景

# style.short_story.title
source: Short story
zh_hant: 短篇故事

# synonyms.cancel
source: Cancel
zh_hant: 取消

# synonyms.empty
source: No English matches found
zh_hant: 找不到對應的英文詞

# synonyms.subtitle
source: Meanings of %@
zh_hant: 「%@」的意思

# synonyms.title
source: Choose English word
zh_hant: 選擇英文詞

# tab.story
source: Story
zh_hant: 故事

# tab.words
source: Words
zh_hant: 詞彙

# words.empty.subtitle
source: Tap + to save a word you want to learn.
zh_hant: 點右上角 + 加入你想學的詞。

# words.empty.title
source: No words yet
zh_hant: 還沒有詞彙

# words.no_matches
source: No matching words.
zh_hant: 找不到符合的詞彙。
